
&НаСервере
Процедура ОбновитьНаСервере()
	ОбновитьПланировщик();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура КонецНеделиПриИзменении(Элемент)
	ИзменилисьДаты(КонецНедели);
КонецПроцедуры

&НаКлиенте
Процедура ИзменилисьДаты(ДатаПериода)
	НачалоНедели = НачалоНедели(ДатаПериода);
	КонецНедели = КонецНедели(ДатаПериода);
КонецПроцедуры

&НаКлиенте
Процедура НачалоНеделиПриИзменении(Элемент)
	ИзменилисьДаты(НачалоНедели);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаПериода = ТекущаяДатаСеанса();	
	НачалоНедели = НачалоНедели(ДатаПериода);
	КонецНедели = КонецНедели(ДатаПериода);
	
	ОбновитьПланировщик();

КонецПроцедуры

Процедура ОбновитьПланировщик()
	
	Объект.Планировщик.ТекущиеПериодыОтображения.Очистить();
	Объект.Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоНедели, КонецДня(КонецНедели));
	Объект.Планировщик.Элементы.Очистить();
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.Специалист,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот,
		|	НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот, ДЕНЬ) КАК ДатаПроведенияРабот,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВКМ_ОбслуживаниеКлиента.Специалист) КАК ПредставлениеСпециалиста
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВКМ_ОбслуживаниеКлиента.Специалист = &Специалист";
	

	Если ЗначениеЗаполнено(Специалист) Тогда
		Запрос.УстановитьПараметр("Специалист", Специалист);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВКМ_ОбслуживаниеКлиента.Специалист = &Специалист" , "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоНедели);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецНедели));
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НачалоОбслуживания = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот + (ВыборкаДетальныеЗаписи.ВремяНачалаРабот - Дата(1,1,1));
		КонецОбслуживания = ВыборкаДетальныеЗаписи.ДатаПроведенияРабот + (ВыборкаДетальныеЗаписи.ВремяОкончанияРабот - Дата(1,1,1));		
		ЭлементПланировщика = Объект.Планировщик.Элементы.Добавить(НачалоОбслуживания, КонецОбслуживания);
		ЭлементПланировщика.Значение = ВыборкаДетальныеЗаписи.Ссылка;
		ЭлементПланировщика.Текст = ВыборкаДетальныеЗаписи.ПредставлениеСпециалиста;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры
