
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// {{Еськин Д.Л. Доработка кода __ от 04.01.2025
	ВКМ_ДобавитьСозданныеРеквизиты();
	ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживанияНаСервере();	
	// }}Еськин Д.Л. Доработка кода __ от 04.01.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// {{Еськин Д.Л. Доработка кода __ от 05.01.2025
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Объект.ВКМ_ДатаНачалаДействияДоговора = Неопределено;
		Объект.ВКМ_ДатаОкончанияДействияДоговора = Неопределено;
		Объект.ВКМ_СтоимостьЧасаРаботы = Неопределено;
		Объект.ВКМ_СуммаАбонентскойПлаты = Неопределено;
	Иначе
		Если ВКМ_ПроверитьЗаполнениеРеквизита(Объект.ВКМ_ДатаНачалаДействияДоговора, "Период действия договора с", "Объект.ВКМ_ДатаНачалаДействияДоговора") Тогда
			Отказ = Истина;
		КонецЕсли;
		Если ВКМ_ПроверитьЗаполнениеРеквизита(Объект.ВКМ_ДатаОкончанияДействияДоговора, "Период действия договора по", "Объект.ВКМ_ДатаОкончанияДействияДоговора") Тогда
			Отказ = Истина;
		КонецЕсли;
		Если ВКМ_ПроверитьЗаполнениеРеквизита(Объект.ВКМ_СуммаАбонентскойПлаты, "Абонентская плата", "Объект.ВКМ_СуммаАбонентскойПлаты") Тогда
			Отказ = Истина;
		КонецЕсли;
		Если ВКМ_ПроверитьЗаполнениеРеквизита(Объект.ВКМ_СтоимостьЧасаРаботы, "Стоимость часа работы", "Объект.ВКМ_СтоимостьЧасаРаботы") Тогда
			Отказ = Истина;
		КонецЕсли;
		Если Объект.ВКМ_ДатаОкончанияДействияДоговора < Объект.ВКМ_ДатаНачалаДействияДоговора Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дата начала действия договора меньше даты окончания!'"));
			Отказ = Истина;
		КонецЕсли;		
	КонецЕсли;
	// }}Еськин Д.Л. Доработка кода __ от 05.01.2025
	
КонецПроцедуры	


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// {{Еськин Д.Л. Доработка кода __ от 04.01.2025
	ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживания();
	// }}Еськин Д.Л. Доработка кода __ от 04.01.2025
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ДобавитьСозданныеРеквизиты()

	ВКМ_ГруппаПараметрыОбслуживания = Элементы.Добавить("ВКМ_ГруппаПараметрыОбслуживания", Тип("ГруппаФормы"), ЭтотОбъект);
	ВКМ_ГруппаПараметрыОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВКМ_ГруппаПараметрыОбслуживания.ОтображатьЗаголовок = Истина;
	ВКМ_ГруппаПараметрыОбслуживания.Заголовок = "Данные договора абонентского обслуживания";
	ВКМ_ГруппаПараметрыОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ВКМ_ГруппаПараметрыОбслуживания.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	ВКМ_ГруппаПараметрыОбслуживания.ОтображатьОтступСлева = Истина;
	ВКМ_ГруппаПараметрыОбслуживания.Отображение = ОтображениеОбычнойГруппы.Нет;
	ВКМ_ГруппаПараметрыОбслуживания.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
	
	ВКМ_ГруппаДатаОбслуживания = Элементы.Добавить("ВКМ_ГруппаДатаОбслуживания", Тип("ГруппаФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ВКМ_ГруппаДатаОбслуживания.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ВКМ_ГруппаДатаОбслуживания.ОтображатьЗаголовок = Ложь;
	ВКМ_ГруппаДатаОбслуживания.Заголовок = "Период действия договора";
	ВКМ_ГруппаДатаОбслуживания.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ВКМ_ГруппаДатаОбслуживания.ОтображатьОтступСлева = Истина;
	
	ВКМ_ДекорацияДатаОбслуживания = Элементы.Добавить("ВКМ_ДекорацияПериодОбслуживания", Тип("ДекорацияФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДекорацияДатаОбслуживания.Вид = ВидДекорацииФормы.Надпись;
	ВКМ_ДекорацияДатаОбслуживания.Заголовок = "Период действия договора";
	
	ВКМ_ДатаНачалаДействияДоговора = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ВКМ_ДатаНачалаДействияДоговора.Заголовок = "с";
	
	ВКМ_ДатаОкончанияДействияДоговора = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"), ВКМ_ГруппаДатаОбслуживания);
	ВКМ_ДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_ДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ВКМ_ДатаОкончанияДействияДоговора.Заголовок = "по";
	
	ВКМ_СуммаАбонентскойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ВКМ_СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";

	ВКМ_СтоимостьЧасаРаботы = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ВКМ_ГруппаПараметрыОбслуживания);
	ВКМ_СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ВКМ_СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживанияНаСервере()
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = Ложь;
	Иначе
		Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ИзменитьВидимостьГруппыПараметрыОбслуживания()
	Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = Ложь;
	Иначе
		Элементы.ВКМ_ГруппаПараметрыОбслуживания.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВКМ_ПроверитьЗаполнениеРеквизита(Реквизит, ИмяПоля, ПутьКДанным) Экспорт
	Отказ = Истина;
	Если ЗначениеЗаполнено(Реквизит) Тогда
		Отказ = Ложь;
	Иначе 
		ТекстСообщения = СтрШаблон("Поле ""%1"" не заполнено", ИмяПоля);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , ПутьКДанным);
	КонецЕсли;
	Возврат Отказ;	
КонецФункции
#КонецОбласти